Repository: CofficLab/GitOK
Catalog: Packages/PluginGitNetworkSettings/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Adjust settings
zh_hans: 调整设置
zh_hk: 調整設置

source: All network operations honor the new values.
zh_hans: 所有网络操作遵循新值。
zh_hk: 所有網絡操作遵循新值。

source: Apply to remotes
zh_hans: 应用到远程
zh_hk: 應用到遠程

source: CA file path
zh_hans: CA 文件路径
zh_hk: CA 檔案路徑

source: Certificate
zh_hans: 证书
zh_hk: 憑證

source: Choose
zh_hans: 选择
zh_hk: 選擇

source: Clear
zh_hans: 清除
zh_hk: 清除

source: Configure proxy, SSL, and timeout values.
zh_hans: 配置代理、SSL 与超时值。
zh_hk: 配置代理、SSL 與超時值。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Enable Git SSL certificate verification
zh_hans: 启用 Git SSL 证书验证
zh_hk: 啟用 Git SSL 憑證驗證

source: Git network configuration saved
zh_hans: Git 网络配置已保存
zh_hk: Git 網路設定已儲存

source: HTTP proxy
zh_hans: HTTP 代理
zh_hk: HTTP 代理

source: HTTPS proxy
zh_hans: HTTPS 代理
zh_hk: HTTPS 代理

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Network
zh_hans: 网络
zh_hk: 網路

source: Open Keychain Access
zh_hans: 打开钥匙串访问
zh_hk: 開啟鑰匙圈存取

source: Persist
zh_hans: 持久保存
zh_hk: 持久保存

source: Proxy
zh_hans: 代理
zh_hk: 代理

source: Proxy Support
zh_hans: 代理支持
zh_hk: 代理支持

source: Route Git traffic through HTTP or SOCKS proxies.
zh_hans: 让 Git 流量经由 HTTP 或 SOCKS 代理。
zh_hk: 讓 Git 流量經由 HTTP 或 SOCKS 代理。

source: SSL Verification
zh_hans: SSL 校验
zh_hk: SSL 校驗

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Set connection and operation timeouts to match your network.
zh_hans: 设置连接与操作超时，贴合你的网络。
zh_hk: 設置連接與操作超時，貼合你的網絡。

source: Settings are written to the Git config.
zh_hans: 设置写入 Git 配置。
zh_hk: 設置寫入 Git 配置。

source: Talk to remotes the way your network expects.
zh_hans: 按你的网络期望与远程通信。
zh_hk: 按你的網絡期望與遠程通信。

source: The CA file is written to `http.sslCAInfo`. Disabling SSL verification is only suitable for temporary troubleshooting; enterprise networks should prioritize importing trusted CA certificates.
zh_hans: CA 文件会写入 `http.sslCAInfo`。仅建议在临时排查问题时关闭 SSL 验证；企业网络应优先导入受信任的 CA 证书。
zh_hk: CA 檔案會寫入 `http.sslCAInfo`。僅建議在臨時排除問題時關閉 SSL 驗證；企業網路應優先匯入受信任的 CA 憑證。

source: Timeout Control
zh_hans: 超时控制
zh_hk: 超時控制

source: Timeouts
zh_hans: 超时
zh_hk: 超時

source: Tune certificate verification for corporate environments.
zh_hans: 为企业环境调整证书校验。
zh_hk: 為企業環境調整證書校驗。

source: Verifies the certificate of remote hosts over HTTPS
zh_hans: 验证通过 HTTPS 连接的远程主机证书
zh_hk: 驗證透過 HTTPS 連線的遠端主機憑證

source: Writes to Git global config `http.proxy` and `https.proxy`. If the proxy requires authentication, use the format `http://user:password@host:port`.
zh_hans: 写入 Git 全局配置 `http.proxy` 和 `https.proxy`。如果代理需要认证，请使用 `http://user:password@host:port` 格式。
zh_hk: 寫入 Git 全域設定 `http.proxy` 和 `https.proxy`。如果代理需要驗證，請使用 `http://user:password@host:port` 格式。

source: global config
zh_hans: 全局配置
zh_hk: 全局配置

source: tuning areas
zh_hans: 调优区域
zh_hk: 調優區域
